app/controllers/products_controller.rb

SELECT "products".* FROM "products"   ORDER BY title
---
  def index
    @products = Product.all

INSERT INTO "products" ("created_at", "description", "image_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-06-07 08:04:57.052753"], ["description", ""], ["image_url", ""], ["title", ""], ["updated_at", "2014-06-07 08:04:57.052753"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "image_url" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["image_url", "http://image.baidu.com/"], ["updated_at", "2014-06-07 03:40:52.862168"]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

SELECT  "products".* FROM "products"  WHERE "products"."id" = ?  ORDER BY title LIMIT 1  [["id", 2]]
---
    def set_product
      @product = Product.find(params[:id])